list_one = [2, True, 1]

# Удаляет все элементы из массива.
# list_one.clear()


# Добавляет элемент в конец массива.
# list_one.append(2)

# Вставляет элемент на определенную позицию.
# list_one.insert(1,'username')

# Удаляет первый найденный элемент с заданным значением.
# list_one.remove(1)

# Удаляет элемент на определенной позиции и возвращает его значение.
# list_one.pop(1)

# Возвращает количество элементов с заданным значением  -
# list_one.count(1)

# Возвращает индекс первого найденного элемента с заданным значением -
# print(list_one.index(1))

# Сортирует элементы массива
# list_one.sort()

# Переворачивает порядок элементов.
# list_one.reverse()

# Создает копию массива.
# list_two = list_one.copy()

print(list_one)
